Tekla Open API Reference for Tekla Structures 2025
GraphicsDrawer.RemoveTemporaryGraphicsObject Method
 Remove a temporary graphic object from all views.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void RemoveTemporaryGraphicsObject(
	int GraphicObjectID
)
Public Sub RemoveTemporaryGraphicsObject (
	GraphicObjectID As Integer
)
Parameters
GraphicObjectID
Type: System.Int32
The identifier that was returned when the object was created.
See Also
Reference
GraphicsDrawer Class
Tekla.Structures.Model.UI Namespace